; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph4 - mode
	thermograph3 - mode
	image5 - mode
	thermograph0 - mode
	infrared2 - mode
	infrared1 - mode
	Star0 - direction
	Star4 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation2 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(supports instrument4 image5)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 thermograph0)
	(supports instrument7 image5)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument9 image5)
	(supports instrument9 infrared2)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star1)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite0 Planet12)
	(pointing satellite1 GroundStation5)
	(pointing satellite2 Star9)
	(have_image Star7 thermograph3)
	(have_image Phenomenon8 thermograph3)
	(have_image Star9 thermograph0)
	(have_image Planet10 infrared2)
	(have_image Planet10 thermograph0)
	(have_image Star11 image5)
	(have_image Star11 infrared2)
	(have_image Planet12 infrared1)
	(have_image Planet12 thermograph0)
	(have_image Star13 image5)
	(have_image Star13 infrared1)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 14
2. (calibrate satellite3 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 0 of 14
3. (turn_to satellite3 star9 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star9)
   goals met: 0 of 14
4. (take_image satellite3 star9 instrument7 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 1 of 14
5. (turn_to satellite3 star13 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star13)
   goals met: 1 of 14
6. (take_image satellite3 star13 instrument7 image5)
   added: (have_image star13 image5)
   goals met: 2 of 14
7. (turn_to satellite3 planet12 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 planet12)
   goals met: 2 of 14
8. (take_image satellite3 planet12 instrument7 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 14
9. (turn_to satellite3 planet10 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet10)
   goals met: 3 of 14
10. (turn_to satellite2 star9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star9)
   goals met: 4 of 14
11. (turn_to satellite1 groundstation5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation5)
   goals met: 5 of 14
12. (turn_to satellite0 star0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star0)
   goals met: 5 of 14
13. (take_image satellite3 planet10 instrument7 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 6 of 14
14. (take_image satellite3 planet10 instrument7 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 7 of 14
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 14
16. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 7 of 14
17. (turn_to satellite0 phenomenon8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 14
18. (take_image satellite0 phenomenon8 instrument1 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 8 of 14
19. (turn_to satellite0 star13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star13)
   goals met: 8 of 14
20. (take_image satellite0 star13 instrument1 infrared1)
   added: (have_image star13 infrared1)
   goals met: 9 of 14
21. (turn_to satellite0 star7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star7)
   goals met: 9 of 14
22. (take_image satellite0 star7 instrument1 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 10 of 14
23. (turn_to satellite0 planet12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet12)
   goals met: 11 of 14
24. (take_image satellite0 planet12 instrument1 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 12 of 14
25. (turn_to satellite3 star11 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star11)
   goals met: 12 of 14
26. (take_image satellite3 star11 instrument7 image5)
   added: (have_image star11 image5)
   goals met: 13 of 14
27. (take_image satellite3 star11 instrument7 infrared2)
   added: (have_image star11 infrared2)
   goals met: 14 of 14
